---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightFamily.SetLightShapeStyle(Autodesk.Revit.DB.Lighting.LightShapeStyle)
source: html/a0317a74-208f-09e7-788c-47336b0c19c1.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily.SetLightShapeStyle Method

Set the light shape style to the given shape style

## Syntax (C#)
```csharp
public void SetLightShapeStyle(
	LightShapeStyle lightShapeStyle
)
```

## Parameters
- **lightShapeStyle** (`Autodesk.Revit.DB.Lighting.LightShapeStyle`) - The light shape style value to set the light shape style to

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration